experiments/results/baseline-jaeger/raw/20260623_224052_compose-post_R500_t4_c40_d60.txt
# workload=compose-post
# rate=500
# threads=4
# connections=40
# duration=60
# timestamp=20260623_224052

Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  4 threads and 40 connections

  Thread calibration: mean lat.: 5.319ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 5.417ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 5.306ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 5.375ms, rate sampling interval: 16ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.33ms    2.47ms  10.36ms   94.62%
    Req/Sec   128.63     92.02   375.00     71.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.89ms
 75.000%    4.70ms
 90.000%    5.84ms
 99.000%   10.36ms
 99.900%   49.09ms
 99.990%   75.14ms
 99.999%   79.55ms
100.000%   79.55ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.409     0.000000            1         1.00
       3.033     0.100000         2509         1.11
       3.257     0.200000         5001         1.25
       3.459     0.300000         7497         1.43
       3.663     0.400000         9998         1.67
       3.887     0.500000        12486         2.00
       4.015     0.550000        13746         2.22
       4.155     0.600000        15003         2.50
       4.307     0.650000        16228         2.86
       4.487     0.700000        17499         3.33
       4.695     0.750000        18733         4.00
       4.815     0.775000        19364         4.44
       4.951     0.800000        19980         5.00
       5.107     0.825000        20604         5.71
       5.311     0.850000        21222         6.67
       5.539     0.875000        21852         8.00
       5.675     0.887500        22159         8.89
       5.843     0.900000        22472        10.00
       6.015     0.912500        22783        11.43
       6.251     0.925000        23094        13.33
       6.527     0.937500        23404        16.00
       6.719     0.943750        23562        17.78
       6.931     0.950000        23717        20.00
       7.167     0.956250        23874        22.86
       7.407     0.962500        24028        26.67
       7.763     0.968750        24184        32.00
       7.995     0.971875        24262        35.56
       8.239     0.975000        24340        40.00
       8.527     0.978125        24419        45.71
       8.799     0.981250        24497        53.33
       9.263     0.984375        24575        64.00
       9.495     0.985938        24613        71.11
       9.775     0.987500        24652        80.00
      10.079     0.989062        24691        91.43
      10.543     0.990625        24730       106.67
      10.967     0.992188        24769       128.00
      11.271     0.992969        24791       142.22
      11.543     0.993750        24808       160.00
      11.879     0.994531        24828       182.86
      12.463     0.995313        24847       213.33
      13.319     0.996094        24867       256.00
      13.815     0.996484        24877       284.44
      14.703     0.996875        24886       320.00
      15.351     0.997266        24896       365.71
      16.383     0.997656        24906       426.67
      18.703     0.998047        24916       512.00
      21.567     0.998242        24921       568.89
      24.559     0.998437        24925       640.00
      32.687     0.998633        24930       731.43
      35.455     0.998828        24935       853.33
      49.343     0.999023        24940      1024.00
      52.095     0.999121        24943      1137.78
      54.655     0.999219        24945      1280.00
      57.727     0.999316        24947      1462.86
      58.591     0.999414        24950      1706.67
      60.095     0.999512        24952      2048.00
      61.311     0.999561        24954      2275.56
      63.711     0.999609        24955      2560.00
      66.111     0.999658        24956      2925.71
      66.623     0.999707        24957      3413.33
      67.519     0.999756        24958      4096.00
      69.503     0.999780        24959      4551.11
      71.423     0.999805        24960      5120.00
      71.423     0.999829        24960      5851.43
      71.807     0.999854        24961      6826.67
      71.807     0.999878        24961      8192.00
      75.135     0.999890        24962      9102.22
      75.135     0.999902        24962     10240.00
      75.135     0.999915        24962     11702.86
      77.055     0.999927        24963     13653.33
      77.055     0.999939        24963     16384.00
      77.055     0.999945        24963     18204.44
      77.055     0.999951        24963     20480.00
      77.055     0.999957        24963     23405.71
      79.551     0.999963        24964     27306.67
      79.551     1.000000        24964          inf
#[Mean    =        4.334, StdDeviation   =        2.467]
#[Max     =       79.488, Total count    =        24964]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29949 requests in 1.00m, 6.14MB read
Requests/sec:    499.06  
Transfer/sec:    104.78KB

# docker compose ps
NAME                                     IMAGE                                                COMMAND                  SERVICE                  CREATED        STATUS             PORTS
socialnetwork-compose-post-service-1     deathstarbench/social-network-microservices:latest   "ComposePostService"     compose-post-service     11 hours ago   Up About an hour   
socialnetwork-home-timeline-redis-1      redis                                                "docker-entrypoint.s…"   home-timeline-redis      11 hours ago   Up About an hour   6379/tcp
socialnetwork-home-timeline-service-1    deathstarbench/social-network-microservices:latest   "HomeTimelineService"    home-timeline-service    11 hours ago   Up About an hour   
socialnetwork-jaeger-agent-1             jaegertracing/all-in-one:1.62.0                      "/go/bin/all-in-one-…"   jaeger-agent             11 hours ago   Up About an hour   4317-4318/tcp, 5775/udp, 5778/tcp, 9411/tcp, 14250/tcp, 14268/tcp, 6831-6832/udp, 0.0.0.0:16686->16686/tcp, [::]:16686->16686/tcp
socialnetwork-media-frontend-1           yg397/media-frontend:xenial                          "/usr/local/openrest…"   media-frontend           11 hours ago   Up About an hour   0.0.0.0:8081->8080/tcp, [::]:8081->8080/tcp
socialnetwork-media-memcached-1          memcached                                            "docker-entrypoint.s…"   media-memcached          11 hours ago   Up About an hour   11211/tcp
socialnetwork-media-mongodb-1            mongo:4.4.6                                          "docker-entrypoint.s…"   media-mongodb            11 hours ago   Up About an hour   27017/tcp
socialnetwork-media-service-1            deathstarbench/social-network-microservices:latest   "MediaService"           media-service            11 hours ago   Up About an hour   
socialnetwork-nginx-thrift-1             yg397/openresty-thrift:xenial                        "/usr/local/openrest…"   nginx-thrift             11 hours ago   Up About an hour   0.0.0.0:8080->8080/tcp, [::]:8080->8080/tcp
socialnetwork-post-storage-memcached-1   memcached                                            "docker-entrypoint.s…"   post-storage-memcached   11 hours ago   Up About an hour   11211/tcp
socialnetwork-post-storage-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   post-storage-mongodb     11 hours ago   Up About an hour   27017/tcp
socialnetwork-post-storage-service-1     deathstarbench/social-network-microservices:latest   "PostStorageService"     post-storage-service     11 hours ago   Up About an hour   0.0.0.0:10002->9090/tcp, [::]:10002->9090/tcp
socialnetwork-social-graph-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   social-graph-mongodb     11 hours ago   Up About an hour   27017/tcp
socialnetwork-social-graph-redis-1       redis                                                "docker-entrypoint.s…"   social-graph-redis       11 hours ago   Up About an hour   6379/tcp
socialnetwork-social-graph-service-1     deathstarbench/social-network-microservices:latest   "SocialGraphService"     social-graph-service     11 hours ago   Up About an hour   
socialnetwork-text-service-1             deathstarbench/social-network-microservices:latest   "TextService"            text-service             11 hours ago   Up About an hour   
socialnetwork-unique-id-service-1        deathstarbench/social-network-microservices:latest   "UniqueIdService"        unique-id-service        11 hours ago   Up About an hour   
socialnetwork-url-shorten-memcached-1    memcached                                            "docker-entrypoint.s…"   url-shorten-memcached    11 hours ago   Up About an hour   11211/tcp
socialnetwork-url-shorten-mongodb-1      mongo:4.4.6                                          "docker-entrypoint.s…"   url-shorten-mongodb      11 hours ago   Up About an hour   27017/tcp
socialnetwork-url-shorten-service-1      deathstarbench/social-network-microservices:latest   "UrlShortenService"      url-shorten-service      11 hours ago   Up About an hour   
socialnetwork-user-memcached-1           memcached                                            "docker-entrypoint.s…"   user-memcached           11 hours ago   Up About an hour   11211/tcp
socialnetwork-user-mention-service-1     deathstarbench/social-network-microservices:latest   "UserMentionService"     user-mention-service     11 hours ago   Up About an hour   
socialnetwork-user-mongodb-1             mongo:4.4.6                                          "docker-entrypoint.s…"   user-mongodb             11 hours ago   Up About an hour   27017/tcp
socialnetwork-user-service-1             deathstarbench/social-network-microservices:latest   "UserService"            user-service             11 hours ago   Up About an hour   
socialnetwork-user-timeline-mongodb-1    mongo:4.4.6                                          "docker-entrypoint.s…"   user-timeline-mongodb    11 hours ago   Up About an hour   27017/tcp
socialnetwork-user-timeline-redis-1      redis                                                "docker-entrypoint.s…"   user-timeline-redis      11 hours ago   Up About an hour   6379/tcp
socialnetwork-user-timeline-service-1    deathstarbench/social-network-microservices:latest   "UserTimelineService"    user-timeline-service    11 hours ago   Up About an hour